// 1.函数嵌套函数
// 2.内部函数可以再外部访问，如果无法访问就没有意义。不会随着外部函数的出栈而销毁
// 3.被闭包的函数在外部访问时，变量查找？ 作用域，作用域链查找
// js 作用域链式静态的， 是由函数声明的时候函数所在的位置决定，而不是执行的时候。
// 任何函数， 执行时， 都会有短暂的编译，上下文， outer 属性 指向作用域链查找的方向
function foo() {
  function bar() { 
    var a = 1
    console.log(b)
  }
  var b = 2   //
  return bar
}

foo()
const baz = foo()  // this 指向 动态 能销毁吗？ 一定是要离开栈的栈顶的，
// 垃圾回收？ 矛盾就来了， 但是它会将bar 需要的 { b: 2 } 保存起来， 不会被销毁
// 闭包， 其实就是一个背包（堆内存中 不会因为函数的出栈就被回收）， 闭合在两个函数间的变量背包
// 把闭包中的变量就叫自由变量
baz()  // bar函数 入栈， outer 指向foo， 引用 foo b